import random
stus = {1 : "张晶晶" , 2 : "郭飘" , 3:"程明", 4:"邓彭川" , 5: "徐佳伟",
        6 : "柯洪成" , 7 : "柯康" , 8:"彭文杰", 9:"赵俊然" , 10: "陈升臻",
        11 : "周志勇" , 12 : "陈禹兵" ,13:"杨胜", 14:"吴文韬" , 15: "严瑞哲",
        16 : "华豪" , 17 : "方小静" , 18:"黄辉", 19:"魏垚" , 20: "叶冲",
        21 : "吕浩亮" , 22 : "张一波" , 23:"万华", 24:"刘洋华" , 25: "杨尚如",
        26 : "林欢" , 27 : "范丽文" , 28:"马勋", 29:"李行" , 30: "李论",
        31 : "杨义龙" , 32 : "汪梦龙" }
n = int(input("请输入你要抽的人数(1-32)："))
s_num = random.sample(range(1, 33),n)
for i in range(n):
    print("恭喜你中奖了！：",stus[int(s_num[i])])


